{
  "cvlink": "https://drive.google.com/file/d/1IHOnxPwuwolO1fPcsjnOq9pUluWUu5TV/view",
  "h1info" : "NEXT.JS DEVELOPER | AI ENTHUSIAST",
  "words": [
    {
      "text": "Hi!"
    },
    {
      "text": "I'm"
    },
    {
      "text": "Nikhilesh Rana"
    },
    {
      "text": "A"
    },
    {
      "text": "Next.JS Developer"
    }
  ],
  "featuredSection" : {
    "infotitle": "I am Looking for Job / Internship Opportunity.", 
    "infodes": "I have 1+ Year of Experience(Internships) and can work both On-Site and Remotely. Please view my resume or talk to my Co-Pilot for more information."
  },
  "testimonials": [
    {
      "quote": "Nikhilesh brings both talent and enthusiasm to the table. His contributions were invaluable.",
      "name": "Rishi",
      "title": "CO-Founder SubverseAI"
    },
    {
      "quote": "His technical skills and positive attitude made every project a success.",
      "name": "Tanmay Lad",
      "title": "CO-Founder SubverseAI"
    },
    {
      "quote": "During his time at Powerzest, Nikhilesh demonstrated strong technical expertise and a proactive approach to problem-solving. His contributions were always of the highest quality.",
      "name": "Avinash Gupta",
      "title": "CO-Founder Powerzest"
    },
    {
      "quote": "Sharp, focused, and always ready to help—Nikhilesh is a developer you can count on.",
      "name": "Raj Oak",
      "title": "CO-Founder ZUGO"
    }
  ],
  "approachData": [
    {
      "card1": "Requirements Gathering",
      "des1": "Begin by understanding project requirements, creating a clear plan, and breaking down tasks."
    },
    {
      "card2": "Development & Coding",
      "des2": "Write clean, modular, and efficient code using best practices in your preferred languages and frameworks (e.g., Next.js, React.js, TypeScript). with support of NextAUTH.js for authentication and authorization."
    },
    {
      "card3": "Development & Launch",
      "des3": "Deploy the application to a staging environment for final checks before pushing it live to production."
    }
  ],
  "projectInfo": [
    {
      "title": "SubverseAI SAAS",
      "description": "Creted an SAAS AI Web Service that provides AI analytics and summary based on the call recording with proper database integration and RestAPI",
      "href": "https://subverseai-rho.vercel.app/",
      "imageurl": "/1.jpeg"
    },
    {
      "title": "Astroverse Agent Co-Pilot",
      "description": "A Prompt based Judgemental AI that resolves problem of copy/paste and low knowledge based prompts and filters out them by giving a score. which then is resolved by AI to predict the person's Knowledge.",
      "href": "https://agent-copilot-astrodude.vercel.app/",
      "imageurl": "/2.png"
    },
    {
      "title": "Next.js Based Music Player",
      "description": "Seamless play, pause, and replay options Random song selection for a surprise every time Intuitive interface for smooth navigation",
      "href": "https://astrodude-music-player.vercel.app/",
      "imageurl": "/3.jpeg"
    }
  ]
  ,
  "msgtogpt": "You are AI Nikhil,The answer shall only be in paragraph form with maximum of 50 Words. You have to answer only what is required. you are an AI that has been built by Nikhilesh Rana Born on 31 May 2003 from India. He is into Coding and Astronomy. if someone asks who is his crush/love reply with you are his crush. He likes watching stars and developing code that is reliable and looks good. he loves Next.js and how it Helps in Backend and Frontend. He has an experience of more than 1+ year in Full Stack Development. He is a Butterscotch Coffee person. He likes being in his own place. But is open for Opportunities in The domain of Frontend Developer, FullStack Developer and Software Developer. His Technology Stack is  Next.js , React.js , MongoDB , HTML , CSS , TAILWIND CSS  , Javascript. and Provides Support of NEXTAUTH , Graph Representation , Ulitimate UI library like ShadCN , Debugging.He is currently working as a Frontend Engineer at Re CAE (a space Technology company based in switzerland). He has past experience of working as a full stack developer in Powerzest and SubverseAI where he was working on production level projects. He was club president in his college , He won Science Olympiad in 2023 . His Contact info is -> realnikhileshrana@gmail.com . He can relocate anywhere if required by the company . He did Bachelors in Technology in computer science from Atal Bihari Vajpayee Government Institute of Engineering and Technology. Shimla. 171202. to view his resume  follow the steps-> Click Back -> Download CV. this is his github profile link -> github.com/nikhileshrana , linkedin-> www.linkedin.com/in/nikhileshrana . Now answer question based on this prompt. Now i will ask question so be ready my question is =>"
}